{
  "header": {
    "title": "Ярослав Запрудский",
    "subtitle": "Ярослав Запрудский - Full-Stack Разработчик"
  },
  "change-language": "Сменить язык",
  "title": "Портфолио Ярослава",
  "name": "Ярослав Запрудский",
  "role": "Full-Stack Разработчик",
  "description": "Увлеченный full-stack разработчик с 3-летним опытом создания масштабируемых веб-приложений. Владеет Express, Vue и React, имеет опыт управления состоянием с использованием Zustand, Pinia и Vuex. Разрабатывает кроссплатформенные приложения на Electron, уверенно использует TypeScript. Посвящает себя созданию интуитивно понятных пользовательских интерфейсов и надежных серверных решений. Ориентирован на предоставление качественных, производительных решений, улучшающих пользовательский опыт и способствующих росту бизнеса.",
  "technologies": "Технологии",
  "work-experience": {
    "title": "Опыт работы",
    "metran0": {
      "name": "ПГ Метран",
      "position": "Full-Stack Разработчик",
      "period": "Февраль 2022 - Октябрь 2022",
      "description": "Разрабатывал интерфейс для взаимодействия с датчиками с использованием TypeScript и Vue 3. Участвовал в разработке логики обработки данных с датчиков (HART). Писал тесты с использованием Jest."
    },
    "baltInfoCom": {
      "name": "БалтИнфоКом",
      "position": "Frontend Разработчик",
      "period": "Октябрь 2022 - Ноябрь 2023",
      "description": "Разрабатывал веб-приложения с использованием Vue 2, TypeScript и Vuex. Рефакторил устаревший код. Проектировал интерфейсы для новых функций приложения. Писал компонентные тесты с использованием Jest. Тесно взаимодействовал с командой бэкенда."
    },
    "infowise": {
      "name": "Infowise",
      "position": "Frontend Разработчик",
      "period": "Ноябрь 2023 - Сентябрь 2024",
      "description": "Поддерживал библиотеку компонентов на Vue 3. Разрабатывал проект с нуля, используя Vue 3 и TypeScript. Настраивал приложение: ESLint, Vite, Vitest и Tailwind CSS. Проводил тестирование приложения с помощью Vitest."
    },
    "metran": {
      "name": "ПГ Метран",
      "position": "Full-Stack Разработчик",
      "period": "Сентябрь 2024 - настоящее время",
      "description": "Разрабатывал пользовательский интерфейс для Electron-приложения для работы с датчиками с использованием Vue 3 и TypeScript. Поддерживал библиотеку компонентов, использовал Tailwind CSS для стилизации. Работал с логикой обработки данных с датчиков. Настроил проект с использованием Vite в качестве сборщика. Писал тесты для компонентов и логики обработки данных с использованием Jest."
    }
  },
  "side-projects": {
    "title": "Сторонние проекты",
    "view-project": "Посмотреть проект",
    "lulight": {
      "name": "Lulight",
      "description": "Интернет-магазин одежды бренда Lulight",
      "url": "https://lulight.ru"
    },
    "chinese-laoshi": {
      "name": "Chinese Laoshi",
      "description": "Приложение для изучения китайского языка методом флеш-карт.",
      "github": "https://github.com/slavoyar/ChineseLaoshi",
      "url": "https://chineselaoshi.slavoyar.tech"
    }
  }
}
